/* لصفوف المجردة (Abstract Classes)
لا يمكن إنشاء كائنات منها: لا يمكن إنشاء كائن مباشرةً من صف مجرد. يجب أن يتم توريث الصف المجرد من صف آخر غير مجرد.
يمكن أن تحتوي على أساليب مجردة وغير مجردة: يمكن أن تحتوي الصفوف المجردة على أساليب مجردة (بدون تنفيذ) وأساليب غير مجردة (مع تنفيذ).
تستخدم كصفوف أساسية: تُستخدم الصفوف المجردة كصفوف أساسية لتوفير واجهة مشتركة للصفوف المشتقة.
الأساليب المجردة (Abstract Methods)
لا تحتوي على تنفيذ: الأساليب المجردة تُعرف بدون جسم (body). يجب أن تُنفذ في الصفوف المشتقة.
يجب أن تكون في صف مجرد: لا يمكن تعريف الأساليب المجردة إلا داخل صف مجرد.
تُجبر الصفوف المشتقة على التنفيذ: الصفوف المشتقة من صف مجرد يجب أن توفر تنفيذًا لكل الأساليب المجردة الموروثة.*/
public abstract class  lesson30_32{
    // لايكمن انشاء كنستركتور في   ال abstract class 
    string msg;
    // الدوال المجردة لايكمن ان نفعلها تمثيل
    public abstract void print();
    public void info(string _msg) {
        this.msg = _msg;
        Console.WriteLine(msg);
    }
}
//هذا النوع من الكلاسات يمكن ان يورت من كلاس اخر لكنة لايورِث
sealed class s1:Lesson25_30d{}
//التوريث هنا غلط لايكمن لانه الكلاس الموروث منها توعهاslead
//class inhert:s1{}
class Implement : lesson30_32
{
    public override void print()
    {
        base.info("Hello Abstract Method");
    }
}
//ه يمكن ان يورت من كلاس اخر او انترفيس لكنة لايورِثabstracct

//interface  mi:lesson30_32{}
